mock-example/src/test/resources/xml/AMRLiRT/calculation/rq1.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Header>
      <mq:AsyncHeader xmlns:mq="http://sbrf.ru/prpc/mq/headers">
         <mq:message-id>message-id</mq:message-id>
         <mq:request-time>2014-12-16T17:55:06.410+04:00</mq:request-time>
         <mq:operation-name>calculationResponse</mq:operation-name>
      </mq:AsyncHeader>
   </soap:Header>
   <soap:Body>
      <tns:calculationRequest xmlns:tns="http://service.lgd.sberbank.luxoft.com/"><!--optional--><tns:ProductType>string</tns:ProductType>
         <!--optional--><tns:Product>string</tns:Product>
         <!--optional--><tns:AgrNum>string</tns:AgrNum>
         <tns:AgrDate>1234567890</tns:AgrDate>
         <!--optional--><tns:LGDType>string</tns:LGDType>
         <tns:CRMId>string</tns:CRMId>
         <!--optional--><tns:Comment>string</tns:Comment>
         <!--optional--><tns:Debt>1234567890</tns:Debt>
         <!--optional--><tns:Rate>1234567890</tns:Rate>
         <!--optional--><tns:LoanMode>string</tns:LoanMode>
         <!--optional--><tns:LoanSum>1234567890</tns:LoanSum>
         <!--optional--><tns:AgrEndDate>1234567890</tns:AgrEndDate>
         <!--optional--><tns:Rating>1234567890</tns:Rating>
         <!--optional--><tns:Limit>1234567890</tns:Limit>
         <tns:Model>string</tns:Model>
         <!--optional--><tns:UnutilizedLimit>1234567890</tns:UnutilizedLimit>
         <!--optional--><tns:AgreementNum>string</tns:AgreementNum>
         <!--optional--><tns:Account><!--optional--><tns:INN>string</tns:INN>
            <!--optional--><tns:Name>string</tns:Name>
         </tns:Account>
         <!--optional--><tns:User>
            <tns:FIO>string</tns:FIO>
            <tns:Position>string</tns:Position>
            <!--optional--><tns:TDivision>string</tns:TDivision>
            <!--optional--><tns:FDivision>string</tns:FDivision>
         </tns:User>
         <!--optional--><tns:ListOfCollateral><!--from 0 to unbounded elements --><tns:Collateral><!--optional--><tns:CRMId>string</tns:CRMId>
               <!--optional--><tns:CollType>string</tns:CollType>
               <!--optional--><tns:AssessType>string</tns:AssessType>
               <!--optional--><tns:AssessSource>string</tns:AssessSource>
               <!--optional--><tns:Assessment>1234567890</tns:Assessment>
               <!--optional--><tns:BusinessValue>string</tns:BusinessValue>
               <!--optional--><tns:ExpertRate>string</tns:ExpertRate>
               <!--optional--><tns:PortfSize>string</tns:PortfSize>
               <!--optional--><tns:AssessmentDate>1234567890</tns:AssessmentDate>
               <!--optional--><tns:PDRate>1234567890</tns:PDRate>
            </tns:Collateral>
         </tns:ListOfCollateral>
         <!--optional--><tns:SiebelMessage>anyString</tns:SiebelMessage>
      </tns:calculationRequest>
   </soap:Body>
</soap:Envelope>
