mock-example/src/test/resources/xml/AMRLiRT/calculation/rq2.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Header>
      <mq:AsyncHeader xmlns:mq="http://sbrf.ru/prpc/mq/headers">
         <mq:message-id>message-id</mq:message-id>
         <mq:request-time>2014-12-16T17:55:06.410+04:00</mq:request-time>
         <mq:operation-name>calculationResponse</mq:operation-name>
      </mq:AsyncHeader>
   </soap:Header>
   <soap:Body>
      <tns:calculationRequest xmlns:tns="http://service.lgd.sberbank.luxoft.com/">
         <tns:ProductType>test1</tns:ProductType>
         <tns:AgrDate>1234567890</tns:AgrDate>
         <tns:CRMId>string</tns:CRMId>
         <tns:Model>string</tns:Model>
      </tns:calculationRequest>
   </soap:Body>
</soap:Envelope>
